tap "1password/tap"
tap "azure/functions"
tap "cantino/mcfly"
tap "chriskilding/semver"
tap "dwarvesf/tap"
tap "espanso/espanso"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
tap "spicetify/tap"
tap "xo/xo"
tap "yxdunc/tools"
brew "autojump"
brew "azure-cli"
brew "bat"
brew "glib"
brew "harfbuzz"
brew "librsvg"
brew "chafa"
brew "choose-rust"
brew "cmake"
brew "coreutils"
brew "curl"
brew "difftastic"
brew "dog"
brew "dust"
brew "fd"
brew "flac"
brew "libsndfile"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "libtool"
brew "fselect"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-flow-avh"
brew "git-when-merged"
brew "gitleaks"
brew "gitui"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "highlight"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "insect"
brew "python@3.9"
brew "maven"
brew "mdcat"
brew "mongosh"
brew "onefetch"
brew "pandoc"
brew "peco"
brew "php", restart_service: true
brew "pinentry-mac"
brew "podman"
brew "poppler"
brew "postgresql@14", restart_service: true
brew "procs"
brew "pwgen"
brew "pyenv"
brew "rargs"
brew "ripgrep-all"
brew "rm-improved"
brew "sd"
brew "starship"
brew "svg2png"
brew "tasksh"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "viddy"
brew "viu"
brew "w3m"
brew "watch"
brew "websocat"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "azure/functions/azure-functions-core-tools@4"
brew "cantino/mcfly/mcfly"
brew "chriskilding/semver/semver"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
brew "spicetify/tap/spicetify-cli", link: false
brew "xo/xo/usql"
cask "1password-cli"
cask "alt-tab"
cask "capslocknodelay"
cask "dbeaver-community"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "mark-text"
cask "ngrok"
cask "pgadmin4"
cask "rectangle"
cask "warp"
vscode "adpyke.codesnap"
vscode "alefragnani.Bookmarks"
vscode "alexkrechik.cucumberautocomplete"
vscode "Azurite.azurite"
vscode "bencoleman.armview"
vscode "Blade.timetracker"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "HuggingFace.huggingface-vscode"
vscode "jebbs.plantuml"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "MohammadBaqer.better-folding"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "Shelex.vscode-cy-helper"
vscode "svelte.svelte-vscode"
vscode "Tyriar.lorem-ipsum"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "voidrot.liquibase"
vscode "vscodevim.vim"
vscode "Vue.volar"
